const page = {}

page.home = `
<h2>我是陳佳妮</h2>
<p>我創建這個網頁的目的是為了想要把我喜歡的東西介紹給大家知道</p>


<img src ="89.jpg"></img>
`

page.music = `
<h3>我喜歡的歌手和團體有很多，以下我介紹我最喜歡的三個團體和歌手:</h3>

<div1>S.H.E</div1>
<p>出道時間於2001年9月11日。
其團名取自三位成員英文名字的首個字母，是由Selina（任家萱）、Hebe（田馥甄）和Ella（陳嘉樺）三位成員組成。
S.H.E亦曾數次獲得來自各國的獎項，迄今共入圍過6次台灣金曲獎，並獲得1座最佳重唱組合獎，以及獲得8次IFPI香港唱片銷量大獎；4次KKBOX數位音樂風雲榜；7次HITO流行音樂獎，2次全球流行音樂金榜，以及其它中文國家和地區所舉辦的頒獎活動的獎項。共總計榮獲超過200多項各種榮譽和獎項。
在2010年提出了「單飛不解散」，各自在不同領域活動至今。</br>
以下這首《戀人未滿》為她們首張專輯《女生宿舍》的主打歌:
</p>
<iframe src="https://www.youtube.com/embed/jL6D7rqk4SQ?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
</br>

<div1>ARASHI(嵐)</div1>
<p>在1999年11月3日發行首張單曲正式出道。
成員有相葉雅紀、松本潤、二宮和也、大野智、櫻井翔等5人，嵐在日語中解作暴風雨，因此有著「在世界捲起暴風雨」、「在藝能界捲起暴風雨」的意思。而日語首假名「あ」及羅馬字首字母「A」均為假名及拉丁字母中的第一個，因此有著「立足頂點」及其延伸「成為頂尖偶像」的意思。
現在Arashi在日本已經成為「國民偶像」。</br>
以下這首《ふるさと(故鄉)》是由知名”放送作家”，也是料亭「下鴨茶寮」老闆的《小山薰堂》作詞的這首歌，描寫一個對故鄉的共同回憶，讓許多因生活上的不得已離開故鄉到東京等大城市工作的人，有了緬懷自己故鄉的機會。
</p>
<iframe src="https://www.youtube.com/embed/FkyYnGV-aik?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
</br>

<div1>藍井 エイル(藍井艾露)</div1>
<p>別名Eir，在2011年10月19日以發售收錄《Fate/Zero》尾曲的單曲《MEMORIA》正式出道。
而她的別名Eir多在作詞時使用，本人曾經說過，深受同為作詞家的Do As Infinity主音伴都美子的影響。而她2016年10月14日發布，因身體健康原因於2016年11月4、5日日本武道館公演結束後將進行無期限活動休止。
2018年2月8日，官方網站宣布2018年春天重新開始活動，並發表新歌「約束」。</br>
以下這首《MEMORIA》為她的出道單曲，此單曲的封面與音樂影片都刻意將臉下半部遮住，其真正的面貌直到第二張單曲《AURORA》發行時才公開。
</p>
<iframe src="https://www.youtube.com/embed/9Smub2xU9Xc?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
`
page.animation =`
<h3>我從小到大就喜歡看卡通，以下是我最喜歡的二個動漫:</h3>

<div1>中華一番!(中華一番！)</div1>
<p>《中華一番》的故事是從西南四川省馳名的菊下樓的繼承權爭奪開始的。其內容描寫中國四川省的年輕廚師劉昴星學習廚藝，到廣州陽泉酒家修行，獲得特級廚師（動畫版中國料理界最高地位）資格，結交許多對於廚藝有志一同的朋友，及最後與“黑暗料理界”對抗過程。</br>
我喜歡它的原因是故事中的每一道料理都非常有戲劇效果，像是仙女從料理中飛出來、餃子像龍一樣會飛等。</br>
另一個原因是我非常喜歡看冒險故事。在這部動漫中，小當家(劉昴星)因為要收集傳說中的廚具來打敗黑暗料理界，而使人們感到幸福。裡面它的核心理念感染了很多人，那就是「料理是要帶給人們幸福」，在人遇到很多不順的事的時候，吃到一些好吃的食物可以讓人有了堅持下去的力量
來面對接下來的難題。</br>
以下是YouTuber-老爹對它的料理的介紹:
</p>
<iframe src="https://www.youtube.com/embed/r1sf1FLCx1U?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
</br>

<div1>羅密歐×茱麗葉（ロミオ×ジュリエット）</div1>
<p>《羅密歐×茱麗葉》是改編自英國詩人及劇作家威廉·莎士比亞劇著《羅密歐與茱麗葉》的電視動畫作品。故事內容為從前被遺忘的空中大陸「新·維洛那」，神秘的巨大力量「愛斯卡勒斯」使其漂浮在空中，為大地帶來了生氣及人民的安定繁榮。《羅密歐與茱麗葉》所講述的是一對被命運捉弄的戀人，14年前蒙太古家族的血腥政變取代了凱普萊特家族的開明統治，從此進入蒙太古的暴政時代，而他們純真的愛情故事，14年後由此在無情的亂世中正式展開……</br>
這部動漫是我少數看動漫看到哭的，因為它的故事劇情雖然和莎士比亞的劇作有些不同但故事最後的走向還是場悲劇。</br>而我會喜歡的原因是他的畫風畫得很精緻，在我看動漫的時候畫風也是我會考慮的對象之一，而它的畫風和配樂是我非常喜歡的風格，所以每一次重看的時候都讓我非常興奮。</br>
以下是《羅密歐×茱麗葉》的片頭曲—《祈り～You Raise Me Up》
</p>
<iframe src="https://www.youtube.com/embed/DDNG4k2wuf8?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
`
page.moive =`
<h3>最近這幾年我迷上了看電影，以下這兩部是我這幾年覺得非常好看的電影:</h3>

<div1>我想吃掉你的胰臟(君の膵臓をたべたい)</div1>
<p>故事內容為沒有名字的少年主角和沒有未來的患者女主角，他在撿到她的日記《共病文庫》後，在班上原沒有交集的兩人，生命自此有了改變。對少年來說，他想要患有胰臟疾病的少女的恢復健康，對少女來說，她想要正常的人生跟他一起活著。個性相反的兩人相遇後，情感得到了互補。</br>
在我看這部電影之前，聽到它的片名我下意識認為這是一部「恐怖片」，而不敢觀看。但在我看完它之後，對於我當初的決定不但沒感到後悔，還慶幸我有去看。因為這一部片的劇情，是會讓人十分感動。我還記得在我看這部電影的時候，周遭的人都和我一樣在大哭，為它所描述的劇情會讓人非常容易陷入進去那個情境之中，
久久難以平復。</br>
也因為這樣我才去看了原著小說，但它的原著小說我認為並不像電影那麼好看，因此我覺得還是看電影就好了。</br>
以下是《我想吃掉你的胰臟》的預告片:
</p>
<iframe src="https://www.youtube.com/embed/uC4pklO8Uzs?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
</br>

<div1>黑豹(Black Panther)</div1>
<p>《黑豹》是一部於2018年上映的美國超級英雄電影，劇情改編自漫威漫畫旗下同名漫畫人物故事。帝查拉返回擁有先進科技卻與世隔絕的瓦干達接下王位，在登基前他尋回秘密執行任務的娜奇雅，並接受登基儀式的考驗。然而積怨已久的宿敵再度出現，將他捲入一場波及瓦干達全國甚至全世界安危的巨大紛爭之中，帝查拉身為國王和黑豹的勇氣和能力將受到最嚴峻的挑戰。</br>
我其實是一個不喜歡看漫威電影的人，但看完這一部電影之後讓我對漫威電影改觀。因為它的故事內容十分精彩，動畫做的非常精緻，不會讓人覺得是電腦動畫像是真的一樣。從它之後會讓想要去看接下來漫威所出的電影。</br>
以下是《黑豹》的預告片:
</p>
<iframe src="https://www.youtube.com/embed/n9OPh03GnI4?rel=0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</br>
`
page.novel =`
<h3>小說已經是我生活中不可或缺的一部份，以下是我喜歡的兩位小說作家:</h3>
<div1>護玄</div1>
<p>護玄（1984年－）是臺灣的女性輕小說作家。代表作為《特殊傳說》(未完結)。另一筆名為「離玄」。</br>
我會喜歡護玄是因為《特殊傳說》這一套書，書中的內容十分逗趣和是我喜歡的風格-冒險和玄幻。也因為這樣我才對她其它的作品感到興趣，進而喜歡上她的其他作品。</br>
以下是護玄本人所經營的部落格:
</p>
<button><a href="https://windslie.tian.yam.com/posts">夜貓鳥宿／喪祭</a></button>
</br>
</br>
<div1>唐家三少</div1>
<p>唐家三少（1981年1月10日－），本名張威，為中國大陸網路作家，法律系畢業。起點中文網白金作家。 作品有小說《光之子》、《善良的死神》、《冰火魔廚》、《狂神》、《生肖守護神》、《酒神》、《天珠變》、《龍王傳說》等。他的版稅收入在中國網絡作家中稱冠，由2008至2012年版稅收入累積達3,300萬元人民幣。2011年11月與當年明月同時入選中國作家協會，為網絡作家入選的首例。
唐家三少也是[起點中文網]白金駐站作家。曾經與另一位著名網絡作家跳舞並稱「小三小五」（「小三」指唐家三少，「小五」指跳舞，取「舞」字諧音）。也曾和台灣著名年輕作家有交集，目前仍是個謎。 2011年11年25日，盛大文學旗下起點中文網簽約的白金作家「唐家三少」依靠極好的人緣，與余華、劉震雲、陳忠實、賈平凹、莫言、二月河等一百餘名作家一起當選中國作家協會全國委員會委員，「唐家三少」也因此成為中國作協最高權力機構的第一位網絡作家。</br>
我會知道這個作家是因為家人介紹，自從我看完他的作品《鬥羅大陸》之後，讓我對他的作品非常著迷。而《鬥羅大陸》也是我最常回也是我最常回味的一部作品，然而他也寫了它的續作-《鬥羅大陸2絕世唐門》(已完結)、《鬥羅大陸3龍王傳說》(未完結)。每當我不知看有什麼小說可以看，我就會重新再看一次，每次看都會覺得一樣有趣。</br>
以下是唐家三少的微博:
</p>
<button><a href="https://weibo.com/tangjiasanshao?is_hot=1">唐家三少</a></button>
</br>
`

page.comic =`
<h3>漫畫和小說一樣都已成為生活中不能缺少的一部份，以下是我最喜歡的兩位漫畫作家</h3>
<div1>松本夏實(松本夏実)</div1>
<p>松本夏實在1993年在集英社的《Ribon Original》上發表作品《不是偶然喲》出道。代表作品是於1999年開始連載《聖龍小公主》。
在這之前，松本夏實的作品最長沒有超過6回，《聖龍小公主》是松本夏實首部連載超過一年的長篇作品，在這部作品之後，續集《聖龍小公主》的連載也超過了一年。之後的連載作品《魔法愛麗絲》僅僅連載了8回就宣告完結。而後松本夏實轉職從事增刊編輯工作。沉寂兩年之後，2008年10月松本夏實在集英社《Ribon》雜誌上連載作品《夢色蛋糕師》重出江湖。</br>
《聖龍小公主》這一部漫畫是我所看的第一部漫畫，因此它的劇情讓我印象非常深刻。而她最近的作品《夢色蛋糕師》有被改編成動漫，在劇情上和原作上稍稍不同，畫風也是如此，但還是非常好看。
在《夢色蛋糕師》這部漫畫裡面，我最喜歡的角色是香草，因為她外表很可愛，但也會很容易暴走。</br>
以下是松本夏實的Twitter:
</p>
<button><a href="https://twitter.com/723pine">松本夏實</a></button>
</br>
</br>
<div1>真島浩(真島ヒロ)</div1>
<p>真島浩（1977年5月3日－）是日本男性漫畫家。以《マジシャン》作品在講談社得到新人漫畫獎後出道，1999年起，在《週刊少年Magazine》開始連載作品《聖石小子》後受到廣大讀者歡迎。由於畫風與尾田榮一郎的暢銷漫畫《ONE PIECE》相似，不少讀者曾誤以為真島與尾田是師兄弟關係，另外有一說則是真島抄襲尾田作品等未經證實的謠言。英語版日本漫畫出版商Del Rey Manga指出他和尾田之所以畫風相近是因為兩人都喜歡鳥山明的作品並且深受其影響。</br>
《魔導少年》這部少年漫畫是我非常喜歡的一部漫畫，因為裡面的工會每一個角色雖然平時大吵大鬧，但在工會發生事情時都會一起出來解決公會目前所遇到的難題。而在這部漫畫哩，我最喜歡的角色是哈比，因為他長得像貓，但會講人話，雖然他只會一種魔法，但他總能在最關鍵的時候出現幫助納茲。</br>
以下是真島浩的Twitter:
</p>
<button><a href="https://twitter.com/hiro_mashima">真島浩</a></button>
</br>
`